{
    "title": "NXP eDoc Suite v3.0 - cryptovision ePasslet Suite - Java Card applet configuration providing Machine Readable Travel Document with \"ICAOApplication\", Extended Access Control with PACE",
    "versions": {
        "eal": ["EAL 1", "EAL 2", "EAL 2+", "EAL 4", "EAL 5", "EAL 5+", "EAL5+", "EAL 6", "EAL 6+"],
        "sha": ["SHA-1", "SHA-224", "SHA-256", "SHA-384", "SHA-512"],
        "des": ["3DES"]
    },
    "table_of_contents": [
        ["A", "Certification", 6],
        ["1", "Preliminary Remarks", 6],
        ["2", "Specifications of the Certification Procedure", 6],
        ["3", "Recognition Agreements", 7],
        ["4", "Performance of Evaluation and Certification", 8],
        ["5", "Validity of the Certification Result", 8],
        ["6", "Publication", 9],
        ["B", "Certification Results", 10],
        ["1", "Executive Summary", 11],
        ["2", "Identification of the TOE", 12],
        ["3", "Security Policy", 13],
        ["4", "Assumptions and Clarification of Scope", 14],
        ["5", "Architectural Information", 14],
        ["6", "Documentation", 15],
        ["7", "IT Product Testing", 15],
        ["8", "Evaluated Configuration", 18],
        ["9", "Results of the Evaluation", 18],
        ["10", "Obligations and Notes for the Usage of the TOE", 20],
        ["11", "Security Target", 20],
        ["12", "Definitions", 20],
        ["13", "Bibliography", 21],
        ["C", "Excerpts from the Criteria", 24],
        ["D", "Annexes", 25]
    ],
    "revisions": [],
    "bibliography": {
        "[1]": "Common Criteria for Information Technology Security Evaluation, Version 3.1, Part 1: Introduction and general model, Revision 4, September 2012 Part 2: Security functional components, Revision 4, September 2012 Part 3: Security assurance components, Revision 4, September 2012 http://www.commoncriteriaportal.org",
        "[2]": "Common Methodology for Information Technology Security Evaluation (CEM), Evaluation Methodology, Version 3.1, Revision 4, September 2012 http://www.commoncriteriaportal.org",
        "[3]": "BSI certification: Scheme documentation describing the certification process (CC-Produkte) and Scheme documentation on requirements for the Evaluation Facility, approval and licencing (CC-Stellen), https://www.bsi.bund.de/zertifizierung",
        "[4]": "Application Notes and Interpretations of the Scheme (AIS) as relevant for the TOE 7 https://www.bsi.bund.de/AIS",
        "[5]": "German IT Security Certificates (BSI 7148), periodically updated list published also on the BSI Website, https://www.bsi.bund.de/zertifizierungsreporte",
        "[6]": "Security Target BSI-DSZ-CC-1022-2018, Version 1.7, 12 February 2018, NXP eDoc Suite v3.0 - cryptovision ePasslet Suite – Java Card applet configuration providing Machine Readable Travel Document with „ICAO Application” Extended Access Control with PACE – Security Target, cv cryptovision GmbH (confidential document)",
        "[7]": "Evaluation Technical Report BSI-DSZ-CC-1023, Version 2, 16 March 2018, NXP eDoc Suite v3.0 - cryptovision ePasslet Suite – Java Card applet configuration providing Machine Readable Travel Document with „ICAO Application”, Extended Access Control with PACE, TÜV Informationstechnik GmbH – Evaluation Body for IT Security (confidential document)",
        "[8]": "Protection Profiles PP-0056 and PP-0068: Machine Readable Travel Document with \"ICAO Application\", Extended Access Control with PACE (EAC PP), Version 1.3.2, 5 December 2012, BSI-CC-PP-0056-V2-2012-MA-02",
        "[9]": "Security Target Lite BSI-DSZ-CC-1022-2018, Version 1.7, 22 February 2018, NXP eDoc Suite v3.0 - cryptovision ePasslet Suite – Java Card applet configuration providing Machine Readable Travel Document with „ICAO Application” Extended Access Control with PACE – Security Target Lite, cv cryptovision GmbH (confidential document) (sanitised public document)",
        "[10]": "Configuration list for the TOE, Revision 13027, 22 Februar 2018, File 2018-02-22_conflist-JCOP3_rev13027.xlsx, cv cryptovision GmbH (confidential document)",
        "[11]": "Guidance Document for the TOE: NXP eDoc Suite v3.0 – cryptovision ePasslet Suite – Java Card applet configuration providing an ICAO MRTD application with Extended Access Control (EACv1) or with Basic Access Control (BAC) and Supplemental Access Control (SAC) Operational Guidance, Version 3.0.7, 16 February 2018, cv cryptovision GmbH",
        "[12]": "Guidance Document for the TOE: NXP eDoc Suite v3.0 – cryptovision ePasslet Suite – Java Card applet configuration providing an ICAO MRTD application with Extended Access Control (EACv1) or with Basic Access Control (BAC) and Supplemental Access Control (SAC) Preparation Guidance, Version 3.0.10, 20 February 2018, cv cryptovision GmbH",
        "[13]": "Guidance Document for the TOE: NXP eDoc Suite v3.0 – cryptovision ePasslet Suite – Java Card Applet Suite providing Electronic ID Documents applications Guidance Manual, Version 3.0.9, 26 February 2018, cv cryptovision GmbH",
        "[14]": "Certification Report NXP JCOP 3 SECID P60 CS (OSB), Report number NSCIB-CC-98209-CR2, version 2, 15 January 2018, TÜV Rheinland Nederland B.V.",
        "[15]": "Evaluation Technical Report for Composition NXP JCOP 3 SECID P60 CS (OSB) – EAL5+, version 3.0, 04 December 2017, Brightsight B.V. (confidential document)",
        "[16]": "Certification Report Crypto Library V3.1.x on P6022y VB, Certificate number CC-17-67206, Report number NSCIB-CC-67206-CR2, 17 November 2017, TÜV Rheinland Nederland B.V.",
        "[17]": "ETR for Composite Evaluation Crypto Library V3.1.x on P6022y VB EAL6+/5+, Reference 17-RPT-421, version 3.0, 24 October 2017, Brightsight B.V. (confidential document)",
        "[18]": "Certification report BSI-DSZ-CC-0973-V2-2016 for NXP Secure Smart Card Controller P6022y VB including IC Dedicated Software, 11 October 2016, Bundesamt für Sicherheit in der Informationstechnik",
        "[19]": "Evaluation Technical Report for Composite Evaluation P6022y VB, version 1, 25 August 2016, TÜV Informationstechnik GmbH (confidential document)",
        "[20]": "Guidance Document for the platform: JCOP 3 SECID P60 CS User Guidance and Administration Manual, Rev. 2.5, 16 November 2017, NXP Semiconductors.",
        "[21]": "NXP eDoc Suite v3.0 – cryptovision ePasslet Suite – Java Card applet configuration providing an ICAO MRTD application with Extended Access Control (EACv1) or with Basic Access Control (BAC) and Supplemental Access Control (SAC) Functional Specification ADV_FSP. Version 3.0.5, 29 September 2017, cv cryptovision GmbH (confidential document)"
    },
    "other": {
        "certid": "BSI-DSZ-CC-1022-2018"
    }
}
