{
    "title": "NXP eDoc Suite v3.5 on JCOP4 P71 – cryptovision ePasslet Suite – Java Card applet configuration providing Machine Readable Travel Document with „ICAO Application”, Extended Access Control with PACE",
    "versions": {
        "eal": ["EAL 4", "EAL 5", "EAL5", "EAL 5+", "EAL 6+"],
        "sha": ["SHA-1", "SHA-224", "SHA-256", "SHA-384", "SHA-512", "SHA512"],
        "rsa": ["RSASignaturePKCS1", "RSASSA-PSS"],
        "des": ["3DES", "Triple-DES"]
    },
    "table_of_contents": [
        ["1", "Introduction", 0],
        ["1.1", "ST/TOE Identification", 4],
        ["1.2", "ST overview", 4],
        ["1.3", "TOE overview", 5],
        ["1.4", "TOE description", 5],
        ["2", "Conformance claims", 14],
        ["2.1", "CC conformance", 14],
        ["2.2", "PP Claim", 14],
        ["2.3", "Statement of Compatibility concerning Composite Security Target", 15],
        ["3", "Security problem definition", 35],
        ["3.1", "Introduction", 35],
        ["3.2", "Assumptions", 37],
        ["3.3", "Threats", 37],
        ["3.4", "Organizational security policies", 39],
        ["4", "Security Objectives", 40],
        ["4.1", "Security Objectives for the TOE", 40],
        ["4.2", "Security Objectives for the Operational Environment", 41],
        ["4.3", "Security Objective Rationale", 42],
        ["5", "Extended Component Definition", 46],
        ["5.1", "Definition of the Family FIA_API", 46],
        ["6", "IT Security Requirements", 47],
        ["6.1", "Security Definitions", 47],
        ["6.2", "Security Functional Requirements for the TOE", 49],
        ["6.3", "Security Assurance Requirements for the TOE", 74],
        ["6.4", "Security Requirements Rationale", 74],
        ["7", "TOE summary specification (ASE_TSS)", 82],
        ["7.1", "TOE Security Functionality", 82],
        ["7.2", "TOE summary specification rationale", 94],
        ["8", "References", 96],
        ["", "Common Criteria", 96],
        ["", "Protection Profiles", 96],
        ["", "TOE and Platform References", 96],
        ["", "ICAO specifications", 97],
        ["", "Cryptography", 97]
    ],
    "revisions": [
        {
            "version": "1.0",
            "date": "2020-12-09",
            "description": "ST-Lite based on ST version 1.0."
        },
        {
            "version": "1.1",
            "date": "2020-12-15",
            "description": "ST-Lite based on ST version 1.1."
        },
        {
            "version": "1.2",
            "date": "2020-12-17",
            "description": "ST-Lite based on ST version 1.2."
        }
    ],
    "bibliography": {
        "[CC_1]": "Common Criteria for Information Technology Security Evaluation, Part 1: Introduc-tion and General Model; Version 3.1, Revision 5, April 2017; CCMB-2017-04-001.",
        "[CC_2]": "Common Criteria for Information Technology Security Evaluation, Part 2: Security Functional Requirements; Version 3.1, Revision 5, April 2017; CCMB-2017-04-002.",
        "[CC_3]": "Common Criteria for Information Technology Security Evaluation, Part 3: Security As-surance Requirements; Version 3.1, Revision 5, April 2017; CCMB-2017-04-003.",
        "[CC_4]": "Common Methodology for Information Technology Security Evaluation, Evaluation Methodology; Version 3.1, Revision 5, April 2017; CCMB-2017-04-004.",
        "[PP0056v2]": "Common Criteria Protection Profile Machine Readable Travel Document with “ICAO Application”, Extended Access Control with PACE (EAC PP), Version 1.3.2, 5.12.2012, BSI-CC-PP-0056-V2-2012, Bundesamt für Sicherheit in der Informationstechnik.",
        "[PP0068v2]": "Common Criteria Protection Profile Machine Readable Travel Document using Stand-ard Inspection Procedure with PACE (PACE PP), Version 1.01, 22.7.2014, BSI-CC-PP-0068-V2-2011-MA-01, Bundesamt für Sicherheit in der Informationstechnik.",
        "[PP0084]": "Security IC Platform Protection Proﬁle, registered and certiﬁed by Bundesamt für Sicherheit in der Informationstechnik (BSI) under the reference BSI-CC-PP-00842014, Rev 1.0, 13 January 2014.",
        "[PP0055]": "Common Criteria Protection Profile Machine Readable Travel Document with „ICAO Application\", Basic Access Control, BSI-PP-0055, Version 1.10, 25th March 2009.",
        "[PP_Javacard]": "Java Card Protection Profile - Open Configuration, Version 3.0 (May 2012), Published by Oracle, Inc.",
        "[ST_OS]": "NXP JCOP 4 P71 Security Target Lite for JCOP 4 P71 / SE050 Rev. 3.7 – 2020-03-17; Evaluation documentation, Final, NSCIB-CC-180212.",
        "[Cert_OS]": "Certification Report JCOP 4 P71, Report number: NSCIB-CC-180212-CR2, TÜV Rhein-land Nederland B.V., 20 March 2020.",
        "[ST_IC]": "NXP Secure Smart Card Controller N7121 with IC Dedicated Software and Crypto Li-brary (R1/R2) Security Target Lite Rev. 1.3 — 8 January 2020 - Evaluation document BSI-DSZ-CC-1040.",
        "[Cert_IC]": "Certification Report BSI-DSZ-CC-1040-2019 for NXP Secure Smart Card Controller N7121 with IC Dedicated Software and Crypto Library from NXP Semiconductors Ger-many GmbH; 2019-06-14 with Assurance Continuity Maintenance Report BSI-DSZ-CC-1040-2019-MA-01 NXP Smart Card Controller N7121 with IC Dedicated Software and Crypto Library (R1/R2) from NXP Semiconductors Germany GmbH, 2020-03-04.",
        "[Guidance]": "[Guidance] consists of three documents: (1) NXP eDoc Suite v3.5 on JCOP4 - cryptovision ePasslet Suite – Java Card Applet Suite providing Electronic ID Documents applications. Guidance Manual. Document Version 1.3.1, 2020-11-30. (2) NXP eDoc Suite v3.5 on JCOP4 - cryptovision ePasslet Suite – Java Card applet configuration providing an ICAO MRTD application with Extended Access Control (EACv1) or with Basic Access Control (BAC) and Supplemental Access Control (SAC) -Preparation Guidance (AGD_PRE). Document Version 1.3.1, 2020-11-30. (3) NXP eDoc Suite v3.5 on JCOP4 - cryptovision ePasslet Suite – Java Card applet configuration providing an ICAO MRTD application with Extended Access Control (EACv1) or with Basic Access Control (BAC) and Supplemental Access Control (SAC) -Operational Guidance (AGD_OPE). Document Version 1.2.0, 2020-11-24.",
        "[GP_CIC]": "GlobalPlatform Card Common Implementation Configuration Version 1.0, February 2014",
        "[GP_v23]": "Global Platform Card Specification v2.3",
        "[AGD_PRE]": "JCOP 4 P71, User manual for JCOP 4 P71, Rev. 3.7, DocNo 469537, 20190531, NXP Semiconductors.",
        "[ICAODoc]": "ICAO Doc 9303, Machine Readable Travel Documents, part 1 – Machine Readable Passports, Sixth Edition, 2006, International Civil Aviation Organization",
        "[ICAO_SAC]": "International Civil Avation Organisation, ICAO Machine Readable Travel Documents, Technical Report, Supplemental Access Control for Machine Readable Travel Docu-ments, Version 1.01, November 11, 2010",
        "[TR-03110]": "Technical Guideline TR-03110-1, Advanced Security Mechanisms for Machine Readable Travel Documents –Part 1 – eMRTDs with BAC/PACEv2 and EACv1, Ver-sion 2.10, Bundesamt für Sicherheit in der Informationstechnik (BSI), 20.03.201278",
        "[TR-ECC]": "Technical Guideline: Elliptic Curve Cryptography according to ISO 15946.TR-ECC, BSI 2006.",
        "[ISO7816-4]": "ISO 7816, Identification cards – Integrated circuit(s) cards with contacts, Part 4: Organization, security and commands for interchange, FDIS 2004",
        "[AIS20]": "Anwendungshinweise und Interpretationen zum Schema (AIS); AIS 20, Version 3, 15.05.2013, Bundesamt für Sicherheit in der Informationstechnik",
        "[AIS31]": "Anwendungshinweise und Interpretationen zum Schema, AIS 31: Funk-tionalitäts-klassen und Evaluationsmethodologie für physikalische Zufalls-zahlengeneratoren, Version 3, Stand:15.05.2013",
        "[ISO14888-3]": "ISO/IEC 14888-3: Information technology – Security techniques – Digital signatures withappendix – Part 3: Certificate-based mechanisms, 1999",
        "[FIPS46-3]": "FEDERAL INFORMATION PROCESSING STANDARDS PUBLICATION FIPS PUB 46-3, DATA ENCRYPTION STANDARD (DES), Reaffirmed 1999 October 25, U.S.DEPARTMENT OF COMMERCE/National Institute of Standards and Technlogy",
        "[NIST800-20]": "NIST Special Publication 800-20, Modes of Operation Validation System for the Tri-ple Data Encryption Algorithm, US Department of Commerce, October 1999",
        "[FIPS180-2]": "Federal Information Processing Standards Publication 180-2 SECURE HASH STANDARD(+ Change Notice to include SHA-224), U.S. DEPARTMENT OF COMMERCE/NationalInstitute of Standards and Technology, 2002 August 1",
        "[FIPS180-4]": "Federal Information Processing Standards Publication 180-4 SECURE HASH STANDARD (SHS), U.S. DEPARTMENT OF COMMERCE/National Institute of Stand-ards and Technology, March 2012",
        "[FIPS197]": "Federal Information Processing Standards Publication 197, ADVANCED ENCRYPTIONSTANDARD (AES), U.S. DEPARTMENT OF COMMERCE/National Insti-tute of Standardsand Technology, November 26, 2001",
        "[ANSIX9.19]": "ANSI X9.19, AMERICAN NATIONAL STANDARD, Financial Institution Retail Message Authentication, 1996",
        "[ANSIX9.62]": "AMERICAN NATIONAL STANDARD X9.62-1999: Public Key Cryptography For The Fi-nancial Services Industry: The Elliptic Curve Digital Signature Algorithm (ECDSA),September 20, 1998",
        "[ISO9796-2]": "ISO/IEC 9796-2, Information Technology – Security Techniques – Digital Signature Schemes giving message recovery – Part 2: Integer factorisation based mecha-nisms, 2002",
        "[ISO15946]": "ISO/IEC 15946. Information technology – Security techniques – Cryptographic tech-niques based on elliptic curves, 2002.",
        "[PKCS#3]": "PKCS #3: Diffie-Hellman Key-Agreement Standard, An RSA Laboratories Technical Note, Version 1.4, Revised November 1, 1993",
        "[ISO18013-3]": "ISO/IEC 18013-3:2009 Information technology -- Personal identification -- ISO-compliant driving licence -- Part 3: Access control, authentication and integrity val-idation (2009)",
        "[NIST800-38A]": "Recommendation for Block Cipher Modes of Operation: Methods and Techniques, NIST Special Publication 800-38A, National Institute of Standards and Technology, December 2001",
        "[NIST800-38B]": "Recommendation for Block Cipher Modes of Operation: The CMAC Mode for Au-thentication, NIST Special Publication 800-38B, National Institute of Standards and Technology, May 2005",
        "[RFC4493]": "Request for Comments: 4493, The AES-CMAC Algorithm, JH. Song et al. University of Washington, Category: Informational, June 2006",
        "[ISO11770-3]": "ISO/IEC 11770 Part 3: Information technology- Security techniques - Key manage-ment: Mechanisms using asymmetric techniques",
        "[FIPS186-3]": "Digital Signature Standard (DSS) - FIPS PUB 186-4, FEDERAL INFORMATION PROCESSING STANDARDS PUBLICATION, June 2009.79",
        "[PKCS1]": "PKCS #1: RSA Encryption Standard – An RSA Laboratories Technical Note Version 2.1",
        "[TR-03111]": "Technical Guideline TR-03111: Elliptic Curve Cryptography; BSI, Version 2.0, 28.6.2012",
        "[TR02102]": "Bundesamt für Sicherheit in der Informationstechnik, Technische Richtlinie - Kryp-tographische Verfahren: Empfehlungen und Schlüssellängen, 09. Januar 2013, BSI-TR02102"
    },
    "other": {
        "certid": "NSCIB-CC-00229285"
    }
}
